# HemisphericalLightDistribution Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HemisphericalLightDistribution Properties
HemisphericalLightDistribution Class See Also
---
The HemisphericalLightDistribution type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from LightDistribution.) |

# See Also
HemisphericalLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace